Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: the `classifier` of the descriptor artifact should match the `version` of the corresponding Quarkus Platform BOM;
ja_jp: ディスクリプタアーティファクトの `classifier` は、対応するQuarkus Platform BOMの `version` と一致している必要があります。

source: the `groupId` of the descriptor artifact should match the `groupId` of the corresponding Quarkus Platform BOM;
ja_jp: ディスクリプタアーティファクトの `groupId` は、対応するQuarkus Platform BOMの `groupId` と一致している必要があります。

source: the `groupId` of the platform BOM
ja_jp: プラットフォーム BOM の `groupId`

source: the `groupId` of the properties artifact should match the `groupId` of the corresponding Quarkus Platform BOM;
ja_jp: プロパティアーティファクトの `groupId` は、対応するQuarkus Platform BOMの `groupId` と一致している必要があります。

source: the `host` is the `directory` in the socket path
ja_jp: `host` はソケットパスの `directory` です

source: the `kafka.bootstrap.servers` is configured
ja_jp: `kafka.bootstrap.servers` が設定されている場合

source: the `list()` method might be surprising at first. It takes fragments of HQL (JP-QL) queries and contextualizes the rest. That makes for very concise but yet readable code.
ja_jp: `list()` メソッドには最初は驚くかもしれません。これは HQL (JP-QL) クエリーの断片を取り、残りの部分をコンテキストに依存させるようにします。これにより非常に簡潔でありながら読みやすいコードになっています。

source: the `list()` method might be surprising at first. It takes fragments of PanacheQL queries (subset of JPQL) and contextualizes the rest. That makes for very concise but yet readable code. MongoDB native queries are also supported.
ja_jp: `list()` の方法は、最初は驚くかもしれません。これは、PanacheQLのクエリ（JPQLのサブセット）の断片を取り出し、残りの部分を文脈化したものです。これにより、非常に簡潔でありながら読みやすいコードになっています。MongoDBのネイティブクエリもサポートしています。

source: the `master-url` is configured
ja_jp: `master-url` が設定されている場合

source: the `movies.avsc` will get compiled to a `Movie.java` file placed in the `target/generated-sources/avsc` directory.
ja_jp: `movies.avsc` は、 `target/generated-sources/avsc` ディレクトリーに配置された `Movie.java` ファイルにコンパイルされます。

source: the `names` variable will contain both `foo` and `bar` and the response will be `hello foo bar`.
ja_jp: `names` 変数には `foo` と `bar` の両方が含まれ、応答は `hello foo bar` になります。

source: the `plugins{}` method in `settings.gradle` is not supported in Gradle 5.x. In this case make sure to explicitly declare the plugin version in the `build.gradle` file like the example below:
ja_jp: `settings.gradle` の `plugins{}` メソッドは Gradle 5.x ではサポートされていません。この場合、以下の例のように `build.gradle` ファイルでプラグインのバージョンを明示的に宣言するようにしてください。

source: the `port` is the `port` in the socket path
ja_jp: `port` はソケットパスの `port` です

source: the `pulsar.client.serviceUrl` is configured
ja_jp: `pulsar.client.serviceUrl`が設定されている

source: the `quarkus-app` directory which contains the `quarkus-run.jar` jar file - being an executable _jar_. Be aware that it's not an _über-jar_ as the dependencies are copied into subdirectories of `quarkus-app/lib/`.
ja_jp: `getting-started-1.0.0-SNAPSHOT-runner.jar`: 実行可能な _jar_ です。依存関係が `target/lib` ディレクトリーにコピーされているので、これは _über-jar_ ではないことに注意してください。

source: the `quarkus.infinispan-client.hosts` is configured
ja_jp: `quarkus.infinispan-client.hosts` が設定されている

source: the `quarkus.infinispan-client.server-list` is configured
ja_jp: `quarkus.infinispan-client.server-list` が設定されている

source: the `quarkus.infinispan-client.uri` is configured
ja_jp: `quarkus.infinispan-client.uri` が設定されている

source: the `quarkus.lra.coordinator-url` is configured
ja_jp: `quarkus.lra.coordinator-url` が設定されている

source: the `rabbitmq-host` or `rabbitmq-port` is configured
ja_jp: `rabbitmq-host` または `rabbitmq-port` が設定されていること

source: the `receiveAndUseContext()` method receives the contents of the `traceparent` header used to bootstrap a new OpenTelemetry context in the destination.
ja_jp: `receiveAndUseContext()` メソッドは、宛先で新しい OpenTelemetry コンテキストをブートストラップするために使用される `traceparent` ヘッダーの内容を受け取ります。

source: the `rest-client-jackson` extension for the REST client support. Use `rest-client` instead if you do not wish to use Jackson
ja_jp: REST クライアントのサポートには `rest-client-jackson` エクステンションを使用してください。Jackson を使用したくない場合は、代わりに `rest-client` を使用してください。

source: the `rest-client-reactive-jackson` extension for the REST client support. Use `rest-client-reactive` instead if you do not wish to use Jackson
ja_jp: REST クライアントサポート用の `rest-client-reactive-jackson` エクステンション。Jackson を使用したくない場合は、代わりに `rest-client-reactive` を使用してください。

source: the `rest-client` and `rest-client-jackson` extensions for the REST client support.
ja_jp: REST クライアントのサポートのために `rest-client` と `rest-client-jackson` のエクステンションを使用しています。

source: the `rest-jackson` extension for the REST server support. Use `rest` instead if you do not wish to use Jackson;
ja_jp: REST サーバーのサポートには、 `rest-jackson` エクステンションを使用してください。Jackson を使用したくない場合は、代わりに `rest` を使用してください；

source: the `resteasy-client` and `resteasy-client-jackson` extensions for the REST client support.
ja_jp: `resteasy-client` と `resteasy-client-jackson` のエクステンションで REST クライアントをサポートしています。

source: the `resteasy-reactive-jackson` extension for the REST server support. Use `resteasy-reactive` instead if you do not wish to use Jackson;
ja_jp: REST サーバーサポート用の `resteasy-reactive-jackson` エクステンション。Jacksonを使用したくない場合は、代わりに `resteasy-reactive` を使用してください。

source: the `resteasy` and `resteasy-jackson` extensions for the REST server support;
ja_jp: REST サーバーのサポートのために `resteasy` と `resteasy-jackson` のエクステンションを使用しています。

source: the `type` of the descriptor artifact should be `json`;
ja_jp: ディスクリプタアーティファクトの `type` は `json` である必要があります。

source: the `type` of the descriptor artifact should be `properties`;
ja_jp: ディスクリプタアーティファクトの `type` は `properties` である必要があります。

source: the `upx` command to be available in the system `PATH`;
ja_jp: `upx` コマンドがシステム `PATH` で利用できること

source: the `version` of the descriptor artifact should match the `version` of the corresponding Quarkus Platform BOM.
ja_jp: ディスクリプタアーティファクトの `version` は、対応するQuarkus Platform BOMの `version` と一致している必要があります。

source: the `version` of the platform BOM
ja_jp: プラットフォーム BOM の `version`

source: the aggregation of all recorded values as a sum
ja_jp: 記録されたすべての値の合計としての集計

source: the application classes,
ja_jp: アプリケーションクラス

source: the application configuration file
ja_jp: アプリケーション設定ファイル

source: the approximate current number of entries in the cache
ja_jp: キャッシュ内のエントリーのおおよその数

source: the arguments
ja_jp: 引数

source: the artifact coordinates of a conditional dependency.
ja_jp: 条件付き依存関係のアーティファクト座標。

source: the artifact coordinates of conditional dependencies on other extensions.
ja_jp: 他のエクステンションへの条件付き依存関係のアーティファクト座標

source: the attribute is set directly on the channel configuration (`mp.messaging.incoming.my-channel.attribute=value`),
ja_jp: 属性はチャネル設定に直接設定されます (`mp.messaging.incoming.my-channel.attribute=value`)。

source: the auto-detection did not find a matching serializer/deserializer
ja_jp: 自動検出が、一致するシリアライザー/デシリアライザーを見つけられなかった場合

source: the bare client (`io.vertx.ext.mail.MailClient`)
ja_jp: ベアクライアント (`io.vertx.ext.mail.MailClient`)

source: the bindings source class must also use `T` as the name of the type variable:
ja_jp: バインディングソースクラスでは、型変数の名前として `T` も使用する必要があります。

source: the call we are making with the client is blocking, hence we need the `@Blocking` annotation on the REST endpoint
ja_jp: クライアントへの呼出はブロッキングされるため、RESTエンドポイントに `@Blocking` アノテーションが必要です。

source: the changes you do to the schema file will be automatically applied to the generated Java files.
ja_jp: スキーマファイルに加えた変更は、生成された Java ファイルに自動的に適用されます。

source: the channel configuration defines the `cloud-events-type` and `cloud-events-source` attributes.
ja_jp: チャネル設定は、 `cloud-events-type` および `cloud-events-source` 属性を定義します。

source: the class name is `${JAVA_PACKAGE}.${NAME_OF_THE_SERVICE}`
ja_jp: クラス名は `${JAVA_PACKAGE}.${NAME_OF_THE_SERVICE}`

source: the class name is structured as follows: `${JAVA_PACKAGE}.${NAME_OF_THE_SERVICE}Grpc.${NAME_OF_THE_SERVICE}ImplBase`
ja_jp: クラス名は以下のように構成されています。 `${JAVA_PACKAGE}.${NAME_OF_THE_SERVICE}Grpc.${NAME_OF_THE_SERVICE}ImplBase`

source: the client stub is injected with the `@RestClient` annotation instead of the usual CDI `@Inject`
ja_jp: クライアントスタブには、通常の CDI `@Inject` ではなく、 `@RestClient` アノテーションが挿入されます。

source: the client will use the registered HTTP Client options over the HTTP Client options provided via CDI if any.
ja_jp: クライアントはCDI経由で提供されたHTTPクライアントオプションよりも、登録されたHTTPクライアントオプションを使用します。

source: the client will use the registered redirect handler over the redirect handler provided via CDI if any.
ja_jp: クライアントは、CDI 経由で提供されたリダイレクトハンドラーよりも、登録されたリダイレクトハンドラーを使用します (存在する場合)。

source: the column names.
ja_jp: 列名。

source: the conditional dependency configuration element;
ja_jp: 条件付き依存関係の設定要素

source: the container port were modified.
ja_jp: コンテナーポートが変更されました。

source: the corresponding Java type
ja_jp: 対応する Java の型

source: the current directory is checked to contain the `.quarkus/config.yaml` file, if the file exists, it will be used to configure the registry client;
ja_jp: カレントディレクトリに `.quarkus/config.yaml` ファイルが存在するかどうかを確認し、ファイルが存在すれば、それを使用してレジストリクライアントが設定されます。

source: the default one
ja_jp: デフォルトのデータソース

source: the default scope of the client for the new extension is `@ApplicationScoped` while the `quarkus-rest-client` defaults to `@Dependent` To change this behavior, set the `quarkus.rest-client-reactive.scope` property to the fully qualified scope name.
ja_jp: 新しいエクステンションのクライアントのデフォルトスコープは `@ApplicationScoped` ですが、 `quarkus-rest-client` のデフォルトは `@Dependent` です。この動作を変更するには、 `quarkus.rest-client-reactive.scope` プロパティーを完全修飾形式のスコープ名に設定します。

source: the default scope of the client for the new extension is `@ApplicationScoped` while the `quarkus-resteasy-client` defaults to `@Dependent` To change this behavior, set the `quarkus.rest-client.scope` property to the fully qualified scope name.
ja_jp: 新しいエクステンションのクライアントのデフォルトスコープは `@ApplicationScoped` ですが、 `quarkus-resteasy-client` のデフォルトは `@Dependent` です。 この動作を変更するには、 `quarkus.rest-client.scope` プロパティーを完全修飾形式のスコープ名に設定します。

source: the deployment extension artifact `quarkus-extension-a-deployment`
ja_jp: デプロイメントエクステンションアーティファクト `quarkus-extension-a-deployment`

source: the disabled channel usage is located in a bean that can be filtered out at build time,
ja_jp: 無効化されたチャネルの使用方法が、ビルド時にフィルタリングできる Bean 内に設定されていること。

source: the duplicated contexts, which are based on a root context, but are NOT shared and represent the processing unit
ja_jp: 複製コンテキストは、ルートコンテキストに基づきますが、共有されず、処理ユニットを表します。

source: the end tag starts with `/` and contains the name of the section (optional): `{#if foo}Foo!{/if}` or `{#if foo}Foo!{/}`,
ja_jp: 終了タグは `/` で始まり、セクションの名前(オプション)を含みます: `{#if foo}Foo!{/if}` または `{#if foo}Foo!{/}` .

source: the extension provides the `io.quarkus.hibernate.orm` capability (multiple `provides` elements are allowed)
ja_jp: エクステンションは、 `io.quarkus.hibernate.orm` のケイパビリティを提供します（複数の `provides` 要素が許可されます）。

source: the extension requires the `io.quarkus.agroal` capability to be provided to function properly (multiple `requires` elements are allowed)
ja_jp: エクステンションが正しく機能するためには、 `io.quarkus.agroal` のケイパビリティが提供されていることが必要です（複数の `requires` 要素が許可されます）。

source: the first one uses the traditional blocking style, it is considered blocking due to its signature.
ja_jp: 1 つ目は伝統的なブロッキングスタイルを採用しており、そのシグネチャーからブロッキングとみなされます。

source: the gRPC `io.grpc.Channel`, that lets you create other types of stubs.
ja_jp: 他のタイプのスタブを作成することができるgRPC `io.grpc.Channel`

source: the gRPC clients
ja_jp: gRPCクライアント

source: the gRPC clients (using the Vert.x gRPC client is recommended)
ja_jp: gRPCクライアント(Vert.x gRPCクライアントの使用を推奨)

source: the gRPC extension (`quarkus-grpc`),
ja_jp: gRPC エクステンション(`quarkus-grpc`),

source: the generated project build/run (with real data) with helpers to run the build
ja_jp: 生成されたプロジェクトのビルド/実行（実データを使用）、およびビルドを実行するためのヘルパー

source: the generated project content (with immutable mocked data) using snapshot testing
ja_jp: スナップショットテストを用いて、生成されたプロジェクトコンテンツ（不変のモックデータを含む）

source: the goal that generates the extension descriptor which every Quarkus runtime extension project should be configured with
ja_jp: すべてのQuarkusランタイムエクステンションプロジェクトが設定されるべきエクステンション記述子を生成するゴール

source: the goal that generates the extension descriptor which every Quarkus runtime extension project should be configured with;
ja_jp: すべてのQuarkusランタイムエクステンションプロジェクトを構成する必要があるエクステンション記述子を生成するゴール

source: the highest value seen within a decaying time window (a gauge).
ja_jp: 減少する時間ウィンドウ内で見られる最高値 (ゲージ)

source: the hosts property is configured, depending on the extension used it can be:
ja_jp: hostsプロパティが設定されている場合。使用するエクステンションにより、次のいずれか:

source: the https://podman.io/getting-started/installation#macos[official Podman documentation]
ja_jp: https://podman.io/getting-started/installation#macos[Podman 公式ドキュメント]

source: the https://smallrye.io/smallrye-stork[SmallRye Stork website].
ja_jp: https://smallrye.io/smallrye-stork[SmallRye Stork ウェブサイト].

source: the implementation needs to specify the type argument `T` as the (de-)serialized type.
ja_jp: この実装は、タイプ引数 `T` を (デ) シリアライズタイプとして指定する必要があります。

source: the kafka password (the client secret from the service account)
ja_jp: kafka パスワード (サービスアカウントからのクライアントシークレット)

source: the link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html[`@RestPath`] annotation is optional: any parameter whose name matches an existing URI template variable will be automatically assumed to have link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html[`@RestPath`].
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html[`@RestPath`] アノテーションはオプションです。名前が既存の URI テンプレート変数に一致する任意のパラメーターは、自動的に link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html[`@RestPath`] を持っていると想定されます。

source: the managed instance of Vert.x
ja_jp: Vert.xのマネージドインスタンス

source: the message metadata contains an `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata` instance,
ja_jp: メッセージメタデータには、 `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata` インスタンスが含まれています。

source: the name of the client for multi-tenant application, see xref:mongodb.adoc#multiple-mongodb-clients[Multiple MongoDB Clients]. Otherwise, the default client will be used.
ja_jp: マルチテナントアプリケーション用のクライアントの名前を指定することもできます。 xref:mongodb.adoc#multiple-mongodb-clients[Multiple MongoDB Clients] を参照してください。それ以外の場合は、デフォルトのクライアントを使います。

source: the name of the client for multitenant application, see xref:mongodb.adoc#multiple-mongodb-clients[Multiple MongoDB Clients]. Otherwise, the default client will be used.
ja_jp: マルチテナントアプリケーション用のクライアントの名前を指定することもできます。 xref:mongodb.adoc#multiple-mongodb-clients[Multiple MongoDB Clients] を参照してください。それ以外の場合は、デフォルトのクライアントを使います。

source: the name of the collection, otherwise the simple name of the class will be used.
ja_jp: コレクションの名前。そうでない場合はクラスのシンプルな名前が使われます。

source: the name of the database, otherwise the `quarkus.mongodb.database` property or a link:{mongodb-doc-root-url}#multitenancy[`MongoDatabaseResolver`] implementation will be used.
ja_jp: データベースの名前、それ以外の場合は `quarkus.mongodb.database` プロパティーまたは link:{mongodb-doc-root-url}#multitenancy[`MongoDatabaseResolver`] 実装が使用されます。

source: the name of the database, otherwise, the `quarkus.mongodb.database` property will be used.
ja_jp: データベースの名前。そうでない場合は `quarkus.mongodb.database` プロパティが使用されます。

source: the name of the extension that will be displayed to users
ja_jp: ユーザーに表示される拡張子の名前

source: the number of entries that were added to the cache
ja_jp: キャッシュに追加されたエントリーの数

source: the number of evictions and the weight of the evicted entries
ja_jp: エヴィクションの回数とエヴィクションエントリの重み

source: the number of rows affected by the query (inserted/deleted/updated/retrieved depending on the query type),
ja_jp: クエリーの影響を受ける行数 (クエリータイプに応じて挿入/削除/更新/取得)、

source: the number of times a cache lookup has been performed, including information about hits and misses
ja_jp: ヒットとミスに関する情報を含む、キャッシュルックアップの実行回数

source: the number of values that have been recorded (a counter)
ja_jp: 記録された値の数 (カウンター)

source: the original request (Query/Mutation)
ja_jp: オリジナルのリクエスト(Query/Mutation)

source: the page is loaded, or
ja_jp: ページが読み込まれる、または

source: the path
ja_jp: パス

source: the request part of the HTTP call, consisting of an HTTP method, a target URI, headers and an optional message body
ja_jp: HTTP メソッド、ターゲット URI、ヘッダー、およびオプションのメッセージ本文で設定される HTTP 呼び出しのリクエスト部分

source: the resource method is annotated with `@io.quarkus.vertx.http.Compressed`, or
ja_jp: ルートメソッドが `@io.quarkus.vertx.http.Compressed` でアノテーションされている、または

source: the resource method is annotated with `@io.quarkus.vertx.http.Uncompressed`, or
ja_jp: ルートメソッドが `@io.quarkus.vertx.http.Uncompressed` でアノテーションされている、または

source: the response part of the HTTP call, consisting of an HTTP response status, headers and an optional message body
ja_jp: HTTP レスポンスステータス、ヘッダー、およびオプションのメッセージ本文で設定される HTTP 呼び出しのレスポンス部分

source: the root contexts representing the event loop, and thus cannot be used to propagate data without leaking it between concurrent processing
ja_jp: イベントループを表すルートコンテキストは、同時処理間でデータを漏らさずに伝播するために使用することはできません。

source: the route method is annotated with `@io.quarkus.vertx.http.Compressed`, or
ja_jp: ルートメソッドが `@ io.quarkus.vertx.http.Compressed` でアノテーションされている、または

source: the route method is annotated with `@io.quarkus.vertx.http.Uncompressed`, or
ja_jp: ルートメソッドが `@io.quarkus.vertx.http.Uncompressed` でアノテーションされている、または

source: the rule engine will evaluate them against the business rules we have configured before, returning the only one that in this case can be approved according to them
ja_jp: ルールエンジンは、事前に設定したビジネスルールに基づいてそれらを評価し、その中で承認可能なものを 1 つだけ返します。

source: the runtime Quarkus extension artifact ID;
ja_jp: ランタイム Quarkus エクステンションアーティファクト ID。

source: the runtime extension artifact `quarkus-extension-a`
ja_jp: ランタイムエクステンションアーティファクト `quarkus-extension-a`

source: the second one uses Mutiny reactive streams in a declarative style, it is considered non-blocking due to its signature.
ja_jp: 2つ目はMutinyのリアクティブストリームを宣言的なスタイルで使用し、そのシグネチャによりノンブロッキングとみなされます。

source: the second one uses Mutiny, it is considered non-blocking due to its signature.
ja_jp: 2 つ目は Mutiny を使用し、そのシグネチャーによりノンブロッキングとみなされます。

source: the selected fields
ja_jp: 選択されたフィールド

source: the serializer/deserializer is not configured
ja_jp: シリアライザー/デシリアライザーが設定されていない場合

source: the standard `@FormParam` can also be used. It allows to override the name of the multipart part.
ja_jp: 標準の `@FormParam` も使用できます。マルチパートパートの名前を上書きできます。

source: the third one uses Mutiny but in a synchronous way, since it doesn't return a "reactive type" it is considered blocking and the link:{runonvthread}[@RunOnVirtualThread] annotation can be used.
ja_jp: 3 つ目は Mutiny を使用しますが、同期的な方法で使用し、"reactive type" を返さないので、ブロッキングとみなされ、 link:{runonvthread}[@RunOnVirtualThread] アノテーションを使用できます。

source: the third one uses Mutiny reactive streams in a synchronous way, since it doesn't return a "reactive type" it is considered blocking and the link:{runonvthread}[@RunOnVirtualThread] annotation can be used.
ja_jp: 3つ目はMutinyのリアクティブストリームを同期的に使うもので"リアクティブ型"を返さないのでブロッキングとみなされ、 link:{runonvthread}[@RunOnVirtualThread] アノテーションが使えます。

source: the two topics are joined on weather station id
ja_jp: weather station id では、この2つのトピックが結合されています

source: the use of `authentication.` is optional, so using `principal.username` has the same result.
ja_jp: `authentication.` の使用はオプションであるため、 `principal.username` を使用しても同じ結果になります。

source: the user home directory is checked to contain the `~/.quarkus/config.yaml` file, if the file exists, it will be used to configure the registry client;
ja_jp: ユーザーのホームディレクトリに `~/.quarkus/config.yaml` ファイルが存在するかどうかを確認し、ファイルが存在する場合は、それを使用してレジストリクライアントを設定します。

source: the value is encoded to JSON if needed
ja_jp: 必要に応じて、値はJSONにエンコードされます。

source: the version of the `quarkus-platform-descriptor-json-plugin`
ja_jp: `quarkus-platform-descriptor-json-plugin` のバージョン

source: the xref:reactive-sql-clients.adoc[Reactive SQL client extension] for the database of your choice; the following options are available:
ja_jp: 選択したデータベース用の link:reactive-sql-clients.html[Reactive SQLクライアントエクステンション]。以下のオプションが利用できます:

source: the xref:stork-reference.adoc[Stork reference guide],
ja_jp: xref:stork-reference.adoc[Stork リファレンスガイド],

source: the xref:stork.adoc[Stork with Consul reference guide],
ja_jp: xref:stork.adoc[Stork with Consul リファレンスガイド]

source: then the `quarkus.oidc.authentication.cookie-domain` property must be set to `company.net`.
ja_jp: 次に、 `quarkus.oidc.authentication.cookie-domain` プロパティーを `company.net` に設定する必要があります。

source: then the behaviour is a bit different, because the transaction will not be terminated until the returned reactive value is terminated. In effect, the returned reactive value will be listened to and if it terminates exceptionally the transaction will be marked for rollback, and will be committed or rolled-back only at termination of the reactive value.
ja_jp: これらは、動作が少し異なり、返されたリアクティブ値が終了するまで、トランザクションは終了しません。実際には、返されたリアクティブ値を聞き、それが例外的に終了した場合、トランザクションはロールバックのためにマークされ、リアクティブ値の終了時にのみコミットまたはロールバックされることになります。

source: then the response will be `hello foo bar`.
ja_jp: 応答は `hello foo bar` になります。

source: there is another guide if you need a xref:rest-client-reactive.adoc[REST client] (including support for JSON).
ja_jp: link:rest-client.html[RESTクライアント]（JSONのサポートを含む）が必要な場合は、別のガイドがあります。

source: there is another guide if you need a xref:rest-client.adoc[REST client based on RESTEasy Classic] (including support for JSON).
ja_jp: RESTEasy Classic をベースにした REST クライアント（ JSON のサポートを含む）が必要な場合は、xref:rest-client.adoc[別のガイド]を参照してください。

source: there is another guide if you need a xref:rest-client.adoc[REST client] (including support for JSON).
ja_jp: xref:rest-client.adoc[RESTクライアント] （JSONのサポートを含む）が必要な場合は、別のガイドがあります。

source: there is another guide if you need to write server xref:rest-json.adoc[JSON REST APIs].
ja_jp: サーバーサイドで JSON REST API を書く必要がある場合は、link:rest-json.html[JSON REST API ガイド]を参照してください。

source: this aggregated data is written out to a third topic (`temperatures-aggregated`)
ja_jp: この集約されたデータは、第三のトピック ( `temperatures-aggregated` ) に書き出されます。

source: this parameter is also optional and defaults to false. It has to be set to true in case the platform BOM *is not generated* and *is not flattened*. Which for example is the case for `io.quarkus:quarkus-bom`.
ja_jp: このパラメータもオプションで、デフォルトは false です。プラットフォームBOMが *生成されず* 、フラット化 *されていない* 場合はtrueに設定しなければなりません。たとえば、 `io.quarkus:quarkus-bom` となります。

source: this parameter is optional, it allows to override some metadata from the Quarkus extension descriptors found in every runtime extension artifact from which the platform descriptor is generated
ja_jp: このパラメータはオプションで、プラットフォームディスクリプタが生成されるすべてのランタイムエクステンションアーティファクトに含まれるQuarkusエクステンションディスクリプタのメタデータの一部をオーバーライドすることができます。

source: this time there should be one active instance, replace `{uuid}` with the id attribute taken from the response
ja_jp: 今回はアクティブなインスタンスが一つあるはずなので、 `{uuid}` をレスポンスから取得した id 属性に置き換えてください。

source: throttled (default starting Quarkus 1.10)
ja_jp: スロットル化(Quarkus 1.10からデフォルト)

source: thus trying for example to invoke that endpoint with a set of loan applications
ja_jp: たとえば、ローン申請のセットでそのエンドポイントを呼び出そうとすると

source: time-series - `.timeseries()` (requires the https://redis.com/modules/redis-timeseries/[Redis Time Series] module on the server side).
ja_jp: time-series - `.timeseries()` (サーバー側に link:https://redis.com/modules/redis-timeseries/[Redis Time Series] モジュールが必要です)。

source: tl;dr
ja_jp: 要約

source: to provide a "context" bean that holds all the information collected during augmentation so that the real components do not need any "late initialization" because they can inject the context bean directly.
ja_jp: 拡張中に収集されたすべての情報を保持する「コンテキスト」Bean を提供し、実際のコンポーネントが「遅延初期化」を必要とせず、直接コンテキスト Bean を注入できるようにするための Bean
